# IsValidFolderName Method (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
ExternalResourceBrowserData..::..IsValidFolderName Method
ExternalResourceBrowserData Class See Also
---
Checks whether the folder name is valid.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2015
# Syntax
C#
---
```text
public bool IsValidFolderName(
	string folderName
)
```

Visual Basic
---
```text
Public Function IsValidFolderName ( _
	folderName As String _
) As Boolean
```

Visual C++
---
```text
public:
bool IsValidFolderName(
	String^ folderName
)
```

# ### Parameters
folderName
    Type: System..::..String The folder name to check.
# ### Return Value
True if the name is a valid folder name, false otherwise.
# Exceptions
| Exception | Condition |
| --- | --- |
| --- | --- |
| Autodesk.Revit.Exceptions..::..ArgumentNullException | A non-optional argument was null |

# See Also
ExternalResourceBrowserData Class
Autodesk.Revit.DB Namespace